Repository: IrquenDev/quber-taxi-apps
Catalog: lib/l10n/app_*.arb
Languages: es

# paymentOfficeInfo
source: Please go to our office at 4th Street / Central and Market, Martín Pérez neighborhood, San Miguel del Padrón to make it. You can check the amount by accessing your profile in the app.
es: Por favor, diríjase a nuestra oficina en Calle 4ta / Central y mercado, reparto Martín Pérez, San Miguel del Padrón para realizarlo. Puede consultar el monto accediendo a su perfil en la app.

# thanksForAttention
source: Thank you for your attention.
es: Gracias por su atención.

# distanceMinimum
source: Minimum Distance: {distance}km
es: Distancia Mínima: {distance}km

# distanceMaximum
source: Maximum Distance: {distance}km
es: Distancia Máxima: {distance}km

# priceMinimumCost
source: Minimum price: {price} CUP
es: Precio mínimo que puede costar: {price} CUP

# priceMaximumCost
source: Maximum price: {price} CUP
es: Precio máximo que puede costar: {price} CUP

# driverStateNotConfirmed
source: Not confirmed
es: No confirmado

# driverStateCanPay
source: Can pay
es: Puede pagar

# driverStatePaymentRequired
source: Payment required
es: Pago requerido

# driverStateEnabled
source: Enabled
es: Habilitado

# driverStateDisabled
source: Disabled
es: Deshabilitado

source: Filter by name
es: Filtrar por nombre

source: Filter by phone
es: Filtrar por teléfono

source: Filter by state
es: Filtrar por estado

source: All states
es: Todos los estados

source: Clear filters
es: Limpiar filtros

source: Drivers
es: Conductores

source: No drivers yet
es: Aún no hay conductores

# noDriversFound
source: No drivers found with the applied filters
es: No se encontraron conductores con los filtros aplicados

source: Confirm Account
es: Confirmar Cuenta

source: Confirm Payment
es: Confirmar Pago

source: Block account
es: Bloquear cuenta

source: Enable account
es: Habilitar cuenta

# errorTryLater
source: Something went wrong, please try again later
es: Algo salió mal, por favor inténtelo más tarde

# peopleCount
source: {count} people
es: {count} personas

source: With pet
es: Con mascota

source: Without pet
es: Sin mascota

source: From: {location}
es: Desde: {location}

source: To: {location}
es: Hasta: {location}

source: Accept Trip
es: Aceptar Viaje

# acceptTripConfirmMessage
source: The client will be notified that their trip request has been accepted. Your location will start being shared only with them.
es: Se le notificará al cliente que se ha aceptado su solicitud de viaje. Su ubicación se comenzará a compartir solo con él.

source: Accept
es: Aceptar

# locationPermissionRequired
source: Location permission is required to start sharing your location with the client
es: Para comenzar a compartir su ubicación con el cliente se necesita su acceso explícito

# locationPermissionBlocked
source: Location permission blocked. Please enable again in settings
es: Permiso de ubicación bloqueado. Habilitar nuevamente en ajustes

# invalidCreditPercentage
source: Percentage must be between 0 and 100
es: El porcentaje debe estar entre 0 y 100

# invalidPrice
source: Price must be greater than 0
es: El precio debe ser mayor a 0

# passwordMinLength
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

source: Trip Description
es: Descripción del viaje

source: My discount code:
es: Mi código de descuento:

# inviteFriendDiscount
source: Invite a friend to use the app and ask them to enter your code when registering or from Settings. They will receive a 10% discount on their next trip.
es: Invita a un amigo a usar la app y pídele que ingrese tu código al registrarse o desde Ajustes. Así recibirá un 10% de descuento en su próximo viaje.

source: Copied
es: Copiado

source: Account Verification
es: Verificación de cuenta

# verificationCodeMessage
source: We have sent a verification code to your phone number via WhatsApp, please enter the code below.
es: Le hemos enviado un código de verificación a su número de teléfono por WhatsApp, por favor coloque el código a continuación.

# verificationCodeLabel
source: Verification code
es: Código de verificación

# verificationCodeHint
source: Enter the code
es: Ingrese el código

# sendCode
source: Send
es: Enviar

source: Resend code
es: Reenviar código

source: Sending code...
es: Enviando código...

source: Verifying...
es: Verificando...

# sendCodeError
source: Error sending code. Please try again.
es: Error al enviar el código. Intente nuevamente.

# verifyCodeError
source: Error verifying code. Please try again.
es: Error al verificar el código. Intente nuevamente.

source: Invalid verification code
es: Código de verificación inválido

source: Verification code expired
es: Código de verificación expirado

# tripRequestCancelled
source: The request for this trip has been cancelled
es: Se ha cancelado la solicitud de este viaje

# operationSuccessful
source: Operation completed successfully
es: Operación realizada con éxito

# errorChangingConfiguration
source: Error. Could not change the configuration
es: Error. No se pudo cambiar la configuración

# errorChangingPassword
source: Error. Could not change the password
es: Error. No se pudo cambiar la contraseña

source: Could not open phone dialer
es: No se pudo abrir el marcador de teléfono

# favoritesBottomItem
source: Favorites
es: Favoritos

source: My Markers
es: Mis marcadores
