Repository: IrquenDev/quber-taxi-apps
Catalog: lib/l10n/app_*.arb
Languages: es

# unknown
source: Unrecognized municipality:
es: Municipio no reconocido:

# originName
source: Select the origin location
es: Seleccione la ubicación de origen

# destinationName
source: Select the destination municipality
es: Seleccione la ubicación de destino

# carPrefer
source: What type of vehicle do you prefer?
es: ¿Qué tipo de vehículo prefiere?

# howTravels
source: How many people are traveling?
es: ¿Cuántas personas viajan?

# pets
source: Are you bringing a pet?
es: ¿Lleva mascota?

# minDistance
source: Minimum distance:
es: Distancia mínima:

# maxDistance
source: Maximum distance:
es: Distancia máxima:

# minPrice
source: Minimum price:
es: Precio mínimo:

# maxPrice
source: Maximum price you can pay:
es: Precio máximo:

# askTaxi
source: Request a taxi
es: Pedir taxi

source: vehicle
es: Vehículo

# settingsHome
source: Settings
es: Ajustes

source: Map
es: Mapa

# mapBottomItem
source: Map
es: Mapa

# requestTaxiBottomItem
source: Order Taxi
es: Pedir Taxi

# settingsBottomItem
source: Settings
es: Ajustes

# quberPointsBottomItem
source: Quber Points
es: P. Quber

source: Quber Points
es: Puntos Quber

source: Accumulated points
es: Puntos acumulados

source: Quber Points Earned
es: Puntos Quber Ganados

# inviteFriendsDescription
source: Invite friends with your referral code to earn more points. Use them to buy discounts on your trips.
es: Invita amigos con tu código de referido para ganar más puntos. Úsalos para comprar descuentos en tus viajes.

# ubicationFailed
source: Your current location is outside the limits of Havana
es: Su ubicación actual está fuera de los límites de La Habana

# permissionsDenied
source: Location permission denied
es: Permiso de ubicación denegado

# permissionDeniedPermanently
source: Location permission permanently denied
es: Permiso de ubicación denegado permanentemente

# locationError
source: Error getting location
es: Error al obtener la ubicación

# destinationsLimitedToHavana
source: Destinations are limited to Havana
es: Los destinos están limitados a La Habana

source: Select location
es: Seleccionar ubicación

# tapMapToSelectLocation
source: Tap the map to select a location
es: Toque el mapa para seleccionar una ubicación

# writeUbication
source: Enter a location...
es: Escriba una ubicación...

# selectUbication
source: Select location from map
es: Seleccione ubicación desde el mapa

# actualUbication
source: Use my current location
es: Usar mi ubicación actual

# outLimits
source: Your current location is outside the limits of Havana
es: Su ubicación actual está fuera de los límites de La Habana

# noResultsTitle
source: Oops!
es: ¡Upps!

# noResultsMessage
source: Our provider wasn't able to find similar results.
es: Nuestro proveedor no fue capaz de encontrar resultados similares.

# noResultsHint
source: Try a more generic search, then refine it using the map.
es: Intenta con una búsqueda más genérica y luego afínala desde el mapa.

# searchDrivers
source: Searching for Drivers...
es: Buscando conductores...

# selectTravel
source: Select a trip
es: Seleccione un viaje

# updateTravel
source: Update trips
es: Actualizar viajes

# noTravel
source: No trips available
es: Sin viajes disponibles

# noAssignedTrip
source: The trip could not be assigned
es: No se pudo asignar el viaje

# countPeople
source: Number of people traveling:
es: Cantidad de personas que viajan:

source: Pet:
es: Mascota:

# typeVehicle
source: Type of vehicle:
es: Tipo de vehículo:

source: Start Trip
es: Iniciar Viaje (Cliente Recogido)

source: people
es: Personas

source: Profile updated successfully
es: Perfil actualizado exitosamente

source: From:
es: Desde:

# until
source: To:
es: Hasta:

# welcomeTitle
source: Welcome to Quber
es: Bienvenido a Quber

# enterPhoneNumber
source: Enter your phone number
es: Introduzca su número de teléfono

# enterPassword
source: Enter your password
es: Introduzca su contraseña

# invalidEmail
source: Enter a valid email
es: Ingrese un correo válido

source: Required field
es: Campo requerido

# requiredEmail
source: Please enter your email
es: Por favor ingrese su correo

# loginButton
source: Log in
es: Iniciar sesión

source: Forgot password
es: Olvidé mi contraseña

# createAccountLogin
source: Create account
es: Crear cuenta

source: Recover Password
es: Recuperar Contraseña

# recoverPasswordDescription
source: Please enter your phone number. We will send you a code to reset your password.
es: Por favor, introduzca su número de teléfono. Le enviaremos un código para restablecer su contraseña.

# sendButton
source: Send
es: Enviar

# noReviews
source: No driver reviews yet
es: Aún sin reseñas del conductor

# reviewSctHeader
source: Your opinion helps us improve
es: Tu opinión nos ayuda a mejorar

# reviewTooltip
source: (Rate the trip from 1 to 5 stars)
es: (Califica el viaje de 1 a 5 estrellas)

# reviewTextHint
source: Help us improve by leaving your opinion
es: Ayúdanos a mejorar dejando tu opinión

source: Trip completed
es: Viaje Finalizado

# resetPasswordTitle
source: Reset Password
es: Restablecer Contraseña

# newPasswordHint
source: New Password
es: Nueva contraseña

# confirmPasswordHint
source: Re-enter your password
es: Vuelva a introducir su contraseña

# resetButton
source: Reset
es: Restablecer

# allFieldsRequiredMessage
source: Please fill out all fields
es: Complete todos los campos

# passwordsDoNotMatchMessage
source: Passwords do not match
es: Las contraseñas no coinciden

# resetSuccessMessage
source: Password reset successfully
es: Contraseña restablecida correctamente

# invalidCodeMessage
source: Invalid or expired code
es: Código inválido o expirado

# unexpectedErrorMessage
source: Unexpected error. Please try again later.
es: Error inesperado. Intente más tarde.

# codeSendErrorMessage
source: Failed to send code. Please try again.
es: Error al enviar el código. Intente nuevamente.

# invalidPhoneMessage
source: Invalid phone number. Must be 8 digits.
es: Número inválido. Debe tener 8 dígitos.

# incorrectPasswordMessage
source: The password is incorrect
es: La contraseña es incorrecta

# phoneNotRegisteredMessage
source: The phone number is not registered
es: El número de teléfono no se encuentra registrado

# unexpectedErrorLoginMessage
source: Something went wrong, please try again later
es: Ocurrió algo mal, por favor inténtelo más tarde

# identityVerify
source: Identity Verification
es: Verificación de identidad

# confirmIdentity
source: We need to confirm your identity.
es: Necesitamos confirmar su identidad.

# noBot
source: Please take a selfie to confirm you are not a bot.
es: Por favor, toma una selfie para confirmar que no eres un bot.

# noUsedImage
source: We will not use this image as a profile picture nor will it be displayed publicly.
es: No usaremos esta imagen como foto de perfil ni se mostrará públicamente.

# verificationUser
source: This step is part of our verification system to ensure the safety of all users.
es: Este paso es parte de nuestro sistema de verificación para garantizar la seguridad de todos los usuarios.

source: Take Selfie
es: Tomar Selfie

source: Create Account
es: Crear Cuenta

source: Name:
es: Nombre:

# nameAndLastName
source: Enter your first and last name
es: Introduzca su nombre y apellidos

source: Phone Number:
es: Núm. teléfono:

source: Password:
es: Contraseña:

# passwordConfirm
source: Confirm Password:
es: Confirmar contraseña:

# endRegistration
source: Complete Registration
es: Finalizar Registro

# accountCreatedSuccess
source: Account successfully created
es: Cuenta creada satisfactoriamente

# errorCreatingAccount
source: An error occurred while creating the account
es: Ocurrió un error al crear la cuenta

# checkYourInternetConnection
source: Check your Internet connection and try again
es: Compruebe su conexión a Internet e intente de nuevo

# nowCanAskForTaxi
source: You can now go get your trip
es: ¡Ya puede ir a por su viaje!

# thanks
source: Thank you for confirming your identity.
es: Gracias por confirmar su identidad.

# successConfirm
source: We have successfully confirmed your identity.
es: Hemos confirmado su identidad con éxito.

# passSecurity
source: This step is part of our verification system to ensure the safety of all users.
es: Este paso es parte de nuestro sistema de verificación para garantizar la seguridad de todos los usuarios.

# driverInfoTitle
source: Driver Information
es: Información del Conductor

source: Average Rating
es: Valoración promedio

source: Vehicle Plate
es: Chapa del vehículo

# seatNumber
source: Number of Seats
es: Número de asientos

source: Vehicle Type
es: Tipo de vehículo

# acceptButton
source: Accept
es: Aceptar

# cancelButton
source: Cancel
es: Cancelar

# adminSettingsTitle
source: Admin Settings
es: Ajustes del Administrador

# pricesSectionTitle
source: Prices
es: Precios

# driverCreditPercentage
source: Quber credit percentage:
es: Porciento de crédito para Quber:

# tripPricePerKm
source: Trip price per KM and vehicle:
es: Precio de viaje por KM y vehículo:

# saveButtonPanel
source: Save
es: Guardar

# passwordsSectionTitle
source: Passwords
es: Contraseñas

source: New password:
es: Nueva contraseña:

source: Confirm password:
es: Confirme contraseña:

# otherActionsTitle
source: Other Actions
es: Otras acciones

source: View all trips
es: Ver todos los viajes

source: View all drivers
es: Ver todos los conductores

# nameDriver
source: Name:
es: Nombre:

# carRegistration
source: License Plate:
es: Chapa:

# phoneNumberDriver
source: Phone Number:
es: Num. teléfono:

source: Email:
es: Correo electrónico:

source: Number of Seats:
es: Número de asientos:

# saveInformation
source: Save
es: Guardar

# myAccount
source: Settings
es: Ajustes

# valuation
source: Accumulated Rating:
es: Valoración acumulada:

# quberCredits
source: Accumulated Quber Credits:
es: Crédito de Quber acumulado:

# nextPay
source: Next Payment Date:
es: Próxima fecha de pago:

# passwordConfirmDriver
source: Confirm Password:
es: Confirme contraseña:

# passwordDriver
source: Password:
es: Contraseña:

source: Go Back
es: Regresar

# aboutUsDriver
source: About Us
es: Sobre Nosotros

# aboutDevDriver
source: About the developer
es: Sobre el desarrollador

source: Log out
es: Cerrar Sesión

# requiredLabel
source: Please complete all required fields
es: Por favor complete todos los campos obligatorios

# aboutUsTitle
source: About Us
es: Acerca de Nosotros

# companyDescription
source: Microenterprise - Taxi Agency
es: Empresa - Agencia de Taxi

# companyAdress
source: 4th Street / Central and Market, Martín Pérez Neighborhood, San Miguel del Padrón
es: Calle 4ta / Central y Mercado, Reparto Martín Pérez, San Miguel del Padrón

# companyAboutText
source: Quber is a microenterprise dedicated to providing transportation services through an organized taxi network, focused on offering safe, punctual and quality service. The company is committed to customer satisfaction and the well-being of its drivers, promoting a reliable, accessible mobility experience centered on respect, responsibility and efficiency.
es: Quber es una Empresa dedicada a ofrecer servicios de transporte a través de una red organizada de taxis, enfocada en brindar un servicio seguro, puntual y de calidad. La empresa se compromete con la satisfacción del cliente y el bienestar de sus conductores, promoviendo una experiencia de movilidad confiable, accesible, centrada en el respeto, la responsabilidad y la eficiencia.

# contactAddress
source: 10th Street between Linea and 23rd
es: Calle 10 entre Línea y 23

# tripsPageTitle
source: Trips
es: Viajes

source: Trip price:
es: Precio del viaje:

source: Trip duration:
es: Duración del viaje:

# clientSectionTitle
source: Client:
es: Cliente:

# clientName
source: Name:
es: Nombre:

# clientPhone
source: Phone:
es: Teléfono:

# driverSectionTitle
source: Driver:
es: Conductor:

# driverName
source: Name:
es: Nombre:

# driverPhone
source: Phone:
es: Teléfono:

# driverPlate
source: License plate:
es: Chapa:

# aboutDeveloperTitle
source: About Developer
es: Acerca del Desarrollador

source: Software company
es: Empresa de software

# aboutText
source: Irquen, founded by three students and built as a family of friends, is now a software company with strong foundations and future vision. Our purpose is to make digitalization fast and accessible for everyone. Our mission is to bring technology to every corner, grow, optimize and expand. Our vision is to push boundaries, find solutions and create what doesn't exist yet.
es: Irquen, fundada por tres estudiantes y construida como una familia de amigos, hoy es una empresa de software con bases firmes y visión de futuro. Su propósito es hacer que la digitalización sea rápida y accesible para todos. Su misión es llevar la tecnología a cada rincón, crecer, optimizar y expandirse. Su visión es superar límites, encontrar soluciones y crear lo que aún no existe.

# identityVerificationTitle
source: Identity Verification
es: Verificación de identidad

# confirmIdentityHeader
source: We need to confirm your identity
es: Necesitamos confirmar su identidad

# takeSelfieInstruction
source: Please take a selfie to confirm you're not a bot.
es: Por favor, toma una selfie para confirmar que no eres un bot.

# selfieUsageNote
source: We won't use this image as a profile picture or display it publicly.
es: No usaremos esta imagen como foto de perfil ni se mostrará públicamente.

# verificationPurpose
source: This step is part of our verification process to ensure the safety of all users.
es: Este paso es parte de nuestro proceso de verificación para garantizar la seguridad de todos los usuarios.

# takeSelfieButton
source: Take Selfie
es: Tomar Selfie

# identityVerificationHeader
source: Identity Verification
es: Verificación de identidad

# thankYouForVerification
source: Thank you for confirming your identity
es: Gracias por confirmar su identidad

# identityConfirmedSuccessfully
source: We have successfully confirmed your identity.
es: Hemos confirmado su identidad con éxito.

# verificationBenefits
source: This process helps us protect your account and maintain a safe community for all users.
es: Este proceso nos ayuda a proteger su cuenta y a mantener nuestra comunidad segura para todos los usuarios.

# createAccountButton
source: Create Account
es: Crear Cuenta

# titlePlaceholder
source: A text should appear here, but it doesn't seem to have loaded.
es: Aquí debería aparecer un texto, pero parece que no se ha cargado.

# descriptionPlaceholder
source: A description should appear here, but it doesn't seem to have loaded. Please wait a moment. If the issue persists, close the app and reopen it.
es: Aquí debería aparecer una descripción, pero parece que no se ha cargado. Por favor, espere un momento. Si el problema persiste, cierre la aplicación y vuelva a abrirla.

# createAccountTitle
source: Create Account
es: Crear Cuenta

# nameLabel
source: Name:
es: Nombre:

# nameHint
source: Enter your full name
es: Introduzca su nombre y apellidos

# plateLabel
source: License Plate:
es: Chapa:

# plateHint
source: Enter your vehicle license plate number
es: Escriba la chapa de su vehículo

# phoneLabel
source: Phone Number:
es: Núm. de teléfono:

# phoneHint
source: Example: 5566XXXX
es: Ej: 5566XXXX

# seatsLabel
source: Number of Seats:
es: Número de asientos:

# seatsHint
source: Example: 4
es: Ej: 4

# licenseLabel
source: Driver's License
es: Licencia de conducción

# attachButton
source: Attach
es: Adjuntar

# vehicleTypeLabel
source: Select your vehicle type:
es: Seleccione su tipo de vehículo:

# standardVehicle
source: Standard
es: Estándar

# standardDescription
source: The most common choice for daily trips. Suitable for 3 or 4 passengers, offering acceptable comfort, good performance, and affordable rates.
es: La opción más común para viajes diarios. Para 3 o 4 pasajeros, con confort aceptable, buen rendimiento y tarifas accesibles.

# familyVehicle
source: Family
es: Familiar

# familyDescription
source: Spacious and comfortable, ideal for groups of 6 or more people or trips with extra luggage. Perfect for group transfers or long journeys.
es: Espacioso y cómodo, ideal para grupos de 6 o más personas o para viajes con equipaje adicional. Perfecto para traslados en grupo o viajes largos.

# comfortVehicle
source: Comfort
es: Confort

# comfortDescription
source: A superior comfort experience. Wider seats, smooth suspension, air conditioning, and greater attention to detail. Ideal for those seeking a more relaxed and pleasant ride.
es: Una experiencia superior en comodidad. Asientos más amplios, suspensión suave, aire acondicionado y mayor atención al detalle. Ideal para quienes buscan un viaje más relajado y placentero.

# passwordLabel
source: Password:
es: Contraseña:

# passwordHint
source: Enter your desired password
es: Introduzca la contraseña deseada

# confirmPasswordLabel
source: Confirm password:
es: Confirme contraseña:

# finishButton
source: Complete Registration
es: Finalizar registro

# motoTaxiDescription
source: Two- or three-wheeled vehicle, ideal for short trips in heavy traffic areas. Economical, agile, and perfect for quick navigation through narrow streets.
es: Vehículo de dos o tres ruedas, ideal para trayectos cortos en zonas con tráfico intenso. Económico, ágil y perfecto para movilizarse rápidamente por calles estrechas.

# updatePasswordSuccess
source: Password updated
es: Contraseña actualizada

# somethingWentWrong
source: Something went wrong, please try again later
es: Algo salió mal, por favor inténtelo más tarde

# checkConnection
source: Please check your internet connection
es: Revise su conexión a internet

source: Save
es: Guardar

source: About Us
es: Sobre Nosotros

# aboutDeveloper
source: About the Developer
es: Sobre el desarrollador

# hintPassword
source: Enter your desired password
es: Introduzca la contraseña deseada

# labelNameDriver
source: Name:
es: Nombre:

# labelCarRegistration
source: Plate:
es: Chapa:

# labelPhoneNumberDriver
source: Phone number:
es: Num. teléfono:

# labelNumberOfSeats
source: Number of seats:
es: Número de asientos:

# quberCreditsLabel
source: Accumulated Quber credits:
es: Crédito de Quber acumulado:

# nextPayLabel
source: Next pay date:
es: Próxima fecha de pago:

# valuationLabel
source: Accumulated rating:
es: Valoración acumulada:

source: Camera permission denied.
es: Permiso de cámara denegado.

# goBackButton
source: Go Back
es: Regresar

# faceDetectionStep
source: 1. Face detection
es: 1. Detección de rostro

# livenessDetectionStep
source: 2. Liveness detection
es: 2. Detección de vida

# selfieCapturingStep
source: 3. Selfie capture
es: 3. Captura de selfie

# compatibilityErrorTitle
source: Compatibility error
es: Error de compatibilidad

# faceDetectionInstruction
source: We recommend placing your face in the indicated area.
es: Le aconsejamos que coloque su rostro en la zona indicada.

# livenessDetectionInstruction
source: We recommend that you do not act rigidly, without blinking or breathing naturally, to ensure accurate face detection.
es: Le aconsejamos que no actúe de forma rígida, sin pestañear o respirar de manera natural, para asegurar una detección precisa del rostro.

# selfieProcessingInstruction
source: Our artificial intelligence is processing the selfie. Please stay connected to the internet and avoid closing the application.
es: Nuestra inteligencia artificial está procesando la selfie. Por favor, manténgase conectado a internet y evite cerrar la aplicación.

# deviceNotCompatibleMessage
source: Your device is not compatible with facial verification. Please contact technical support or try with another device.
es: Su dispositivo no es compatible con la verificación facial. Por favor, contacte con soporte técnico o intente con otro dispositivo.

# imageProcessingErrorTitle
source: Image Processing Error
es: Error de Procesamiento de Imagen

# imageProcessingErrorMessage
source: An error occurred while processing your image. Please try again later.
es: Ocurrió un error al procesar su imagen. Por favor, inténtelo de nuevo más tarde.

# cameraPermissionPermanentlyDeniedTitle
source: Camera Permission Required
es: Permiso de Cámara Requerido

# cameraPermissionPermanentlyDeniedMessage
source: Camera access is permanently denied. To use identity verification, please enable camera permission in your device settings.
es: El acceso a la cámara ha sido denegado permanentemente. Para usar la verificación de identidad, por favor habilite el permiso de cámara en la configuración de su dispositivo.

# goToSettingsButton
source: Go to Settings
es: Ir a Configuración

# confirmExitTitle
source: Confirm Exit
es: Confirmar salida

# confirmExitMessage
source: Are you sure you want to exit? You will lose all progress made so far.
es: ¿Está seguro que desea salir? Perderá todo el progreso realizado hasta ahora.

# passwordMinLengthError
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

source: Passwords do not match
es: Las contraseñas no coinciden

# phoneAlreadyRegistered
source: Phone number is already registered
es: El número de teléfono ya se encuentra registrado

# registrationError
source: We could not complete your registration. Please try again later
es: No pudimos completar su registro. Por favor inténtelo más tarde

source: Creating account...
es: Creando cuenta...

source: New Trip
es: Nuevo Viaje

source: No Connection
es: Sin conexión

# noConnectionMessage
source: The app cannot continue without internet connection
es: La app no podrá continuar sin conexión a internet

source: Needs Approval
es: Necesita Aprobación

# needsApprovalMessage
source: Your account is in the process of activation. To continue, please visit our offices for the technical review of your vehicle and contract signing. We are located at 4th Street / Central and Market, Martín Pérez neighborhood, San Miguel del Padrón. Once you complete this step, you will be able to use the app normally and available trip requests will be displayed.
es: Su cuenta está en proceso de activación. Para continuar, por favor preséntese en nuestras oficinas para la revisión técnica de su vehículo y la firma del contrato. Nos encontramos en Calle 4ta / Central y mercado, reparto Martín Pérez, San Miguel del Padrón. Una vez complete este paso, podrá comenzar a usar la app normalmente y se mostrarán las peticiones de viaje disponibles.

# weWaitForYou
source: We are waiting for you!
es: ¡Le esperamos!

source: Payment Soon
es: Pago próximo

source: Payment Pending
es: Pago pendiente

# inThreeDays
source: in 3 days
es: en 3 días

source: day after tomorrow
es: pasado mañana

source: tomorrow
es: mañana

# paymentReminderSoon
source: We remind you that your next payment date is {timeText}.
es: Le recordamos que su próxima fecha de pago es {timeText}.

# paymentReminderToday
source: Today's scheduled payment date has arrived. You have up to 4 days to make the payment.
es: La fecha de pago programada para hoy ha llegado. Tiene hasta 4 días para realizar el pago.

# paymentExpired
source: The deadline for the payment previously set for {date} has expired.
es: La fecha límite para el pago previamente fijado para el día {date} ha expirado.

# paymentOverdue
source: The scheduled payment date was {date}. You have {days} {daysText} to make the payment.
es: La fecha de pago programada fue el {date}. Tiene {days} {daysText} para realizar el pago.

# paymentLastDay
source: The scheduled payment date was {date}. Today is your last day to make the payment.
es: La fecha de pago programada fue el {date}. Hoy es su último día para realizar el pago.

source: day
es: día

source: days
es: días
